marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_LPI2C.h
/**
*   @file    Reg_eSys_LPI2C.h
*   @version 1.0.1
*
*   @brief   AUTOSAR I2c - LPI2C Registers and Macros Definitions.
*   @details Header file for LPI2C Registers and Macros Definitions.
*
*   @addtogroup I2C
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : ARM
*   Peripheral           : LPI2C
*   Dependencies         : none
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_ASR_REL_4_2_REV_0002_20180713
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2018 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_LPI2C_H
#define REG_ESYS_LPI2C_H

#ifdef __cplusplus
extern "C"
{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely 
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*
* @section Reg_eSys_LPI2C_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7, This violation is due to function
* like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section Reg_eSys_LPI2C_h_REF_2
* Violates MISRA 2004 Required Rule 1.4, The compiler/linker shall
* be checked to ensure that 31 character significance and
* case sensitivity are supported for external identifiers.
* This violation is due to the requirement that requests to have
* a file version check.
*
*/


/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Reg_eSys.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @file           Reg_eSys_LPI2C.h
*/
#define REG_ESYS_LPI2C_VENDOR_ID                    43
#define REG_ESYS_LPI2C_AR_RELEASE_MAJOR_VERSION     4
#define REG_ESYS_LPI2C_AR_RELEASE_MINOR_VERSION     2
/**
* @violates @ref Reg_eSys_LPI2C_h_REF_2 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define REG_ESYS_LPI2C_AR_RELEASE_REVISION_VERSION  2
#define REG_ESYS_LPI2C_SW_MAJOR_VERSION             1
#define REG_ESYS_LPI2C_SW_MINOR_VERSION             0
#define REG_ESYS_LPI2C_SW_PATCH_VERSION             1

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* Check if current file and Reg_eSys header file are of the same version */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((REG_ESYS_LPI2C_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (REG_ESYS_LPI2C_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_LPI2C.h and Reg_eSys.h are different"
    #endif
#endif
/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/

/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/

/*********************************MASTER REGISTERS*********************************/

/**
* @details  LPI2C macro to access register LPI2C Master Control Register (MCR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MCR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000010U))

/**
* @details  LPI2C macro to access register LPI2C Master Status Register (MSR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MSR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000014U))

/**
* @details  LPI2C macro to access register LPI2C Master Interrupt Enable Register (MIER).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MIER_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000018U))

/**
* @details  LPI2C macro to access register LPI2C Master DMA Enable Register (MDER).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MDER_ADDR32(offset)      ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x0000001CU))

/**
* @details  LPI2C macro to access register LPI2C Master Configuration Register 0 (MCFGR0).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MCFGR0_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000020U))

/**
* @details  LPI2C macro to access register LPI2C Master Configuration Register 1 (MCFGR1).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MCFGR1_ADDR32(offset)      ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000024U))

/**
* @details  LPI2C macro to access register LPI2C Master Configuration Register 2 (MCFGR2).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MCFGR2_ADDR32(offset)      ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000028U))

/**
* @details  LPI2C macro to access register LPI2C Master Configuration Register 3 (MCFGR2).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MCFGR3_ADDR32(offset)      ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x0000002CU))

/**
* @details  LPI2C macro to access register LPI2C Master Data Match Register (MDMR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MDMR_ADDR32(offset)        ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000040U))

/**
* @details  LPI2C macro to access register LPI2C Master Clock Configuration Register 0 (MCCR0).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MCCR0_ADDR32(offset)      ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000048U))

/**
* @details  LPI2C macro to access register LPI2C Master Clock Configuration Register 1 (MCCR1).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MCCR1_ADDR32(offset)      ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000050U))

/**
* @details  LPI2C macro to access register LPI2C Master FIFO Control Register (MFCR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MFCR_ADDR32(offset)       ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000058U))

/**
* @details  LPI2C macro to access register LPI2C Master FIFO Status Register (MFCR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MFSR_ADDR32(offset)       ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x0000005CU))

/**
* @details  LPI2C macro to access register LPI2C Master Transmit Data Register (MTDR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MTDR_ADDR32(offset)       ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000060U))

/**
* @details  LPI2C macro to access register LPI2C Master Receive Data Register (MRDR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_MRDR_ADDR32(offset)       ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000070U))

