marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_LPI2C.h
/*********************************SLAVE REGISTERS*********************************/
/**
* @details  LPI2C macro to access register LPI2C Slave Control Register (SCR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SCR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000110U))

/**
* @details  LPI2C macro to access register LPI2C Slave Status Register (SSR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SSR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000114U))

/**
* @details  LPI2C macro to access register LPI2C Slave Interrupt Enable Register (SIER).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SIER_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000118U))

/**
* @details  LPI2C macro to access register LPI2C Slave DMA Enable Register (SDER).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SDER_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x0000011CU))

/**
* @details  LPI2C macro to access register LPI2C Slave Configuration Register 1 (SCFGR1).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SCFGR1_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000124U))

/**
* @details  LPI2C macro to access register LPI2C Slave Configuration Register 2 (SCFGR2).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SCFGR2_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000128U))

/**
* @details  LPI2C macro to access register LPI2C Slave Address Match Register (SAMR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SAMR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000140U))

/**
* @details  LPI2C macro to access register LPI2C Slave Address Status Register (SASR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SASR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000150U))

/**
* @details  LPI2C macro to access register LPI2C Slave Transmit ACK Register (STAR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_STAR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000154U))

/**
* @details  LPI2C macro to access register LPI2C Slave Transmit Data Register (STDR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_STDR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000160U))

/**
* @details  LPI2C macro to access register LPI2C Slave Receive Data Register (SRDR).
* @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define LPI2C_SRDR_ADDR32(offset)    ((uint32)(LPI2C_au32BaseAddrs[(offset)] + (uint32)0x00000170U))


/*****************************************MASTER BITFIELDS*****************************************/

/**
* @brief    LPI2C Registers bits.
* @details  MCR register bit masks.
*/
#define LPI2C_MCR_RRF_MASK_U32                  ((uint32)0x00000200U)
#define LPI2C_MCR_RTF_MASK_U32                  ((uint32)0x00000100U)
#define LPI2C_MCR_DBGEN_MASK_U32                ((uint32)0x00000008U)
#define LPI2C_MCR_DOZEN_MASK_U32                ((uint32)0x00000004U)
#define LPI2C_MCR_RST_MASK_U32                  ((uint32)0x00000002U)
#define LPI2C_MCR_MEN_MASK_U32                  ((uint32)0x00000001U)

#define LPI2C_MCR_RESET_RECEIVE_FIFO_U32        (LPI2C_MCR_RRF_MASK_U32)
#define LPI2C_MCR_RESET_TRANSMIT_FIFO_U32       (LPI2C_MCR_RTF_MASK_U32)

#define LPI2C_MCR_MASTER_ENABLED_IN_DBG_U32     (LPI2C_MCR_DBGEN_MASK_U32)
#define LPI2C_MCR_MASTER_DISABLED_IN_DBG_U32    ((uint32)0x00000000U)

#define LPI2C_MCR_MASTER_ENABLED_IN_DOZE_U32    (LPI2C_MCR_DOZEN_MASK_U32)
#define LPI2C_MCR_MASTER_DISABLED_IN_DOZE_U32   ((uint32)0x00000000U)

#define LPI2C_MCR_MASTER_ENABLE_U32             (LPI2C_MCR_MEN_MASK_U32)
#define LPI2C_MCR_MASTER_DISABLE_U32            ((uint32)0x00000000U)

/**
* @brief    LPI2C Registers bits.
* @details  MSR register bit masks.
*/
#define LPI2C_MSR_RWBITS_MASK_U32          ((uint32)0x00007F00U)

#define LPI2C_MSR_BBF_MASK_U32             ((uint32)0x02000000U)
#define LPI2C_MSR_MBF_MASK_U32             ((uint32)0x01000000U)
#define LPI2C_MSR_DMF_MASK_U32             ((uint32)0x00004000U)
#define LPI2C_MSR_PLTF_MASK_U32            ((uint32)0x00002000U)
#define LPI2C_MSR_FEF_MASK_U32             ((uint32)0x00001000U)
#define LPI2C_MSR_ALF_MASK_U32             ((uint32)0x00000800U)
#define LPI2C_MSR_NDF_MASK_U32             ((uint32)0x00000400U)
#define LPI2C_MSR_SDF_MASK_U32             ((uint32)0x00000200U)
#define LPI2C_MSR_EPF_MASK_U32             ((uint32)0x00000100U)
#define LPI2C_MSR_RDF_MASK_U32             ((uint32)0x00000002U)
#define LPI2C_MSR_TDF_MASK_U32             ((uint32)0x00000001U)

#define LPI2C_MSR_ERROR_FLAGS_MASK_U32     ((uint32)0x00007C00U)

#define LPI2C_BUS_IS_BUSY_U32              (LPI2C_MSR_BBF_MASK_U32)
#define LPI2C_BUS_IS_IDLE_U32              ((uint32)0x00000000U)
                                           
#define LPI2C_MASTER_IS_BUSY_U32           (LPI2C_MSR_MBF_MASK_U32)
#define LPI2C_MASTER_IS_IDLE_U32           ((uint32)0x00000000U)
                                           
#define LPI2C_RECEIVED_MATCHING_DATA_U32   (LPI2C_MSR_DMF_MASK_U32)
                                           
#define LPI2C_PIN_LOW_TIMEOUT_U32          (LPI2C_MSR_PLTF_MASK_U32)
                                           
#define LPI2C_FIFO_ERROR_U32               (LPI2C_MSR_FEF_MASK_U32)
                                           
#define LPI2C_ARBITRATION_LOST_U32         (LPI2C_MSR_ALF_MASK_U32)
                                           
