marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_LPI2C.h
#define LPI2C_UNEXPECTED_NACK_U32          (LPI2C_MSR_NDF_MASK_U32)
                                           
#define LPI2C_STOP_DETECTED_U32            (LPI2C_MSR_SDF_MASK_U32)
                                           
#define LPI2C_END_OF_PACKET_U32            (LPI2C_MSR_EPF_MASK_U32)
                                           
#define LPI2C_RECEIVE_DATA_IS_READY_U32    (LPI2C_MSR_RDF_MASK_U32)
                                           
#define LPI2C_TRANSMIT_DATA_IS_READY_U32   (LPI2C_MSR_TDF_MASK_U32)

/**
* @brief    LPI2C Registers bits.
* @details  MIER register bit masks.
*/
#define LPI2C_MIER_RWBITS_MASK_U32              ((uint32)0x00007F03U)

#define LPI2C_MIER_DMIE_MASK_U32                  ((uint32)0x00004000U)
#define LPI2C_MIER_PLTIE_MASK_U32                 ((uint32)0x00002000U)
#define LPI2C_MIER_FEIE_MASK_U32                  ((uint32)0x00001000U)
#define LPI2C_MIER_ALIE_MASK_U32                  ((uint32)0x00000800U)
#define LPI2C_MIER_NDIE_MASK_U32                  ((uint32)0x00000400U)
#define LPI2C_MIER_SDIE_MASK_U32                  ((uint32)0x00000200U)
#define LPI2C_MIER_EPIE_MASK_U32                  ((uint32)0x00000100U)
#define LPI2C_MIER_RDIE_MASK_U32                  ((uint32)0x00000002U)
#define LPI2C_MIER_TDIE_MASK_U32                  ((uint32)0x00000001U)
                                                  
#define LPI2C_DATA_MATCH_ISR_ENABLE_U32           (LPI2C_MIER_DMIE_MASK_U32)
#define LPI2C_DATA_MATCH_ISR_DISABLE_U32          ((uint32)0x00000000U)
                                                  
#define LPI2C_PIN_LOW_TIMEOUT_ISR_ENABLE_U32      (LPI2C_MIER_PLTIE_MASK_U32)
#define LPI2C_PIN_LOW_TIMEOUT_ISR_DISABLE_U32     ((uint32)0x00000000U)
                                                  
#define LPI2C_FIFO_ERROR_ISR_ENABLE_U32           (LPI2C_MIER_FEIE_MASK_U32)
#define LPI2C_FIFO_ERROR_ISR_DISABLE_U32          ((uint32)0x00000000U)
                                                  
#define LPI2C_ARBITRATION_LOST_ISR_ENABLE_U32     (LPI2C_MIER_ALIE_MASK_U32)
#define LPI2C_ARBITRATION_LOST_ISR_DISABLE_U32    ((uint32)0x00000000U)
                                                  
#define LPI2C_UNEXPECTED_NACK_ISR_ENABLE_U32      (LPI2C_MIER_NDIE_MASK_U32)
#define LPI2C_UNEXPECTED_NACK_ISR_DISABLE_U32     ((uint32)0x00000000U)
                                                  
#define LPI2C_STOP_DETECT_ISR_ENABLE_U32          (LPI2C_MIER_SDIE_MASK_U32)
#define LPI2C_STOP_DETECT_ISR_DISABLE_U32         ((uint32)0x00000000U)

#define LPI2C_END_PACKET_ISR_ENABLE_U32           (LPI2C_MIER_EPIE_MASK_U32)
#define LPI2C_END_PACKET_ISR_DISABLE_U32          ((uint32)0x00000000U)

#define LPI2C_RECEIVE_DATA_ISR_ENABLE_U32         (LPI2C_MIER_RDIE_MASK_U32)
#define LPI2C_RECEIVE_DATA_ISR_DISABLE_U32        ((uint32)0x00000000U)

#define LPI2C_TRANSMIT_DATA_ISR_ENABLE_U32        (LPI2C_MIER_TDIE_MASK_U32)
#define LPI2C_TRANSMIT_DATA_ISR_DISABLE_U32       ((uint32)0x00000000U)

/**
* @brief    LPI2C Registers bits.
* @details  MDER register bit masks.
*/
#define LPI2C_MDER_RDDE_MASK_U32                  ((uint32)0x00000002U)
#define LPI2C_MDER_TDDE_MASK_U32                  ((uint32)0x00000001U)
                                                  
#define LPI2C_MDER_RX_DMA_ENABLE_U32              (LPI2C_MDER_RDDE_MASK_U32)
#define LPI2C_MDER_RX_DMA_DISABLE_U32             ((uint32)0x00000000U)
                                                  
#define LPI2C_MDER_TX_DMA_ENABLE_U32              (LPI2C_MDER_TDDE_MASK_U32)
#define LPI2C_MDER_TX_DMA_DISABLE_U32             ((uint32)0x00000000U)
/**                                               
* @brief    LPI2C Registers bits.                 
* @details  MCFGR0 register bit masks.            
*/                                                
#define LPI2C_MCFGR0_RDMO_MASK_U32                ((uint32)0x00000200U)
#define LPI2C_MCFGR0_CIRFIFO_MASK_U32             ((uint32)0x00000100U)
#define LPI2C_MCFGR0_HRSEL_MASK_U32               ((uint32)0x00000004U)
#define LPI2C_MCFGR0_HRPOL_MASK_U32               ((uint32)0x00000002U)
#define LPI2C_MCFGR0_HREN_MASK_U32                ((uint32)0x00000001U)

/**
* @brief    LPI2C Registers bits.
* @details  MCFGR1 register bit masks.
*/
#define LPI2C_MCFGR1_PINCFG_MASK_U32              ((uint32)0x07000000U)
#define LPI2C_MCFGR1_MATCFG_MASK_U32              ((uint32)0x00070000U)
#define LPI2C_MCFGR1_TIMECFG_MASK_U32             ((uint32)0x00000400U)
#define LPI2C_MCFGR1_IGNACK_MASK_U32              ((uint32)0x00000200U)
#define LPI2C_MCFGR1_AUTOSTOP_MASK_U32            ((uint32)0x00000100U)
#define LPI2C_MCFGR1_PRESCALE_MASK_U32            ((uint32)0x00000007U)

#define LPI2C_2PIN_OPEN_DRAIN_U32                 ((uint32)0x00000000U)
#define LPI2C_2PIN_OUTPUT_ONLY_U32                ((uint32)0x01000000U)
#define LPI2C_2PIN_PUSH_PULL_U32                  ((uint32)0x02000000U)
#define LPI2C_4PIN_PUSH_PULL_U32                  ((uint32)0x03000000U)
#define LPI2C_2PIN_OPEN_DRAIN_SEPARATE_SLAVE_U32  ((uint32)0x04000000U)
#define LPI2C_2PIN_OUTPUT_ONLY_SEPARATE_SLAVE_U32 ((uint32)0x05000000U)
#define LPI2C_2PIN_PUSH_PULL_SEPARATE_SLAVE_U32   ((uint32)0x06000000U)
#define LPI2C_4PIN_PUSH_PULL_INVERTED_OUTPUT_U32  ((uint32)0x07000000U)

#define LPI2C_PIN_LOW_TIMEOUT_SCL_U32             ((uint32)0x00000000U)
#define LPI2C_PIN_LOW_TIMEOUT_SCL_OR_SDA_U32      (LPI2C_MCFGR1_TIMECFG_MASK_U32)

#define LPI2C_NORMAL_ACK_AND_NACK_U32             ((uint32)0x00000000U)
#define LPI2C_TREAT_NACK_AS_ACK_U32               (LPI2C_MCFGR1_IGNACK_MASK_U32)

#define LPI2C_AUTOMATIC_STOP_ENABLE_U32           (LPI2C_MCFGR1_AUTOSTOP_MASK_U32)

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_PRESCALE_U32(value)                 ((uint32)((value) & LPI2C_MCFGR1_PRESCALE_MASK_U32))

/**
* @brief    LPI2C Registers bits.
* @details  MCFGR2 register bit masks.
*/
#define LPI2C_MCFGR2_FILTSDA_MASK_U32     ((uint32)0x0F000000U)
#define LPI2C_MCFGR2_FILTSDA_SHIFT_U32    ((uint32)24U)
#define LPI2C_MCFGR2_FILTSCL_MASK_U32     ((uint32)0x000F0000U)
#define LPI2C_MCFGR2_FILTSCL_SHIFT_U32    ((uint32)16U)
#define LPI2C_MCFGR2_BUSIDLE_MASK_U32     ((uint32)0x000000FFU)

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_FILTSDA_U32(value)         ((uint32)((uint32)((value) << LPI2C_MCFGR2_FILTSDA_SHIFT_U32) & LPI2C_MCFGR2_FILTSDA_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_FILTSCL_U32(value)         ((uint32)((uint32)((value) << LPI2C_MCFGR2_FILTSCL_SHIFT_U32) & LPI2C_MCFGR2_FILTSCL_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_BUSIDLE_U32(value)         (((value) & LPI2C_MCFGR2_BUSIDLE_MASK_U32))

/**
* @brief    LPI2C Registers bits.
* @details  MCFGR3 register bit masks.
*/
#define LPI2C_MCFGR3_PINLOW_MASK_U32     ((uint32)0x000FFF00U)
#define LPI2C_MCFGR3_PINLOW_SHIFT_U32    ((uint32)8U)

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_PINLOW_U32(value)          ((uint32)((uint32)((value) << LPI2C_MCFGR3_PINLOW_SHIFT_U32) & LPI2C_MCFGR3_PINLOW_MASK_U32))

/**
* @brief    LPI2C Registers bits.
* @details  MDMR register bit masks.
*/
#define LPI2C_MDMR_MATCH1_MASK_U32      ((uint32)0x00FF0000U)
#define LPI2C_MDMR_MATCH1_SHIFT_U32     ((uint32)16U)
#define LPI2C_MDMR_MATCH0_MASK_U32      ((uint32)0x000000FFU)

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_MATCH1_U32(value)         ((uint32)((uint32)((value) << LPI2C_MDMR_MATCH1_SHIFT_U32) & LPI2C_MDMR_MATCH1_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_MATCH0_U32(value)         (((value) & LPI2C_MDMR_MATCH0_MASK_U32))

/**
* @brief    LPI2C Registers bits.
* @details  MCCR0 register bit masks.
*/
#define LPI2C_MCCR0_DATAVD_MASK_U32     ((uint32)0x3F000000U)
#define LPI2C_MCCR0_DATAVD_SHIFT_U32    ((uint32)24U)
#define LPI2C_MCCR0_SETHOLD_MASK_U32    ((uint32)0x003F0000U)
#define LPI2C_MCCR0_SETHOLD_SHIFT_U32   ((uint32)16U)
#define LPI2C_MCCR0_CLKHI_MASK_U32      ((uint32)0x00003F00U)
#define LPI2C_MCCR0_CLKHI_SHIFT_U32     ((uint32)8U)
#define LPI2C_MCCR0_CLKLO_MASK_U32      ((uint32)0x0000003FU)

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_DATAVD_U32(value)         ((uint32)((uint32)((value) << LPI2C_MCCR0_DATAVD_SHIFT_U32) & LPI2C_MCCR0_DATAVD_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_SETHOLD_U32(value)        ((uint32)((uint32)((value) << LPI2C_MCCR0_SETHOLD_SHIFT_U32) & LPI2C_MCCR0_SETHOLD_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_CLKHI_U32(value)          ((uint32)((uint32)((value) << LPI2C_MCCR0_CLKHI_SHIFT_U32) & LPI2C_MCCR0_CLKHI_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_CLKLO_U32(value)          (((value) & LPI2C_MCCR0_CLKLO_MASK_U32))

/**
* @brief    LPI2C Registers bits.
* @details  MFCR register bit masks.
*/
#define LPI2C_MFCR_RXWATER_MASK_U32     ((uint32)0x00030000U)
#define LPI2C_MFCR_RXWATER_SHIFT_U32    ((uint32)16U)
#define LPI2C_MFCR_TXWATER_MASK_U32     ((uint32)0x00000003U)

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_RXWATER_U32(value)        ((uint32)((uint32)((value) << LPI2C_MFCR_RXWATER_SHIFT_U32) & LPI2C_MFCR_RXWATER_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_TXWATER_U32(value)        (((value) & LPI2C_MFCR_TXWATER_MASK_U32))

/**
* @brief    LPI2C Registers bits.
* @details  MFSR register bit masks.
*/
#define LPI2C_MFSR_RXCOUNT_MASK_U32     ((uint32)0x00070000U)
#define LPI2C_MFSR_TXCOUNT_MASK_U32     ((uint32)0x00000007U)

/**
* @brief    LPI2C Registers bits.
* @details  MTDR register bit masks.
*/
#define LPI2C_MTDR_CMD_MASK_U32                      ((uint32)0x00000700U)
#define LPI2C_MTDR_DATA_MASK_U32                     ((uint32)0x000000FFU)

