marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_LPI2C.h
#define LPI2C_TRANSMIT_U32                           ((uint32)0x00000000U)
#define LPI2C_RECEIVE_U32                            ((uint32)0x00000100U)
#define LPI2C_GENERATE_STOP_U32                      ((uint32)0x00000200U)
#define LPI2C_RECEIVE_AND_DISCARD_U32                ((uint32)0x00000300U)
#define LPI2C_REPEAT_START_TRANSMIT_U32              ((uint32)0x00000400U)
#define LPI2C_REPEAT_START_TRANSMIT_NACK_U32         ((uint32)0x00000500U)
#define LPI2C_REPEAT_START_TRANSMIT_HS_U32           ((uint32)0x00000600U)
#define LPI2C_REPEAT_START_AND_TRANSMIT_HS_NACK_U32  ((uint32)0x00000700U)

#define LPI2C_MTDR_READ_BIT_MASK_U8                    ((uint8)0x01U)
/**
* @brief    LPI2C Registers bits.
* @details  MRDR register bit masks.
*/
#define LPI2C_MRDR_RXEMPTY_MASK_U32             ((uint32)0x00004000U)
#define LPI2C_MRDR_DATA_MASK_U32                ((uint32)0x000000FFU)
  
#define LPI2C_RECEIVE_FIFO_NOT_EMPTY_U32        ((uint32)0x00000000U)
#define LPI2C_RECEIVE_FIFO_EMPTY_U32            (LPI2C_MRDR_RXEMPTY_MASK_U32)

/*********************************SLAVE BITFIELDS*********************************/

/**
* @brief    LPI2C Registers bits.
* @details  SCR register bit masks.
*/
#define LPI2C_SCR_RRF_MASK_U32                 ((uint32)0x00000200U)
#define LPI2C_SCR_RTF_MASK_U32                 ((uint32)0x00000100U)
#define LPI2C_SCR_FILTDZ_MASK_U32              ((uint32)0x00000020U)
#define LPI2C_SCR_FILTEN_MASK_U32              ((uint32)0x00000010U)
#define LPI2C_SCR_RST_MASK_U32                 ((uint32)0x00000002U)
#define LPI2C_SCR_SEN_MASK_U32                 ((uint32)0x00000001U)

#define LPI2C_SCR_RESET_RECEIVE_FIFO_U32       (LPI2C_SCR_RRF_MASK_U32)
#define LPI2C_SCR_RESET_TRANSMIT_FIFO_U32      (LPI2C_SCR_RTF_MASK_U32)

#define LPI2C_SCR_FILTER_ENABLED_IN_DOZE_U32   ((uint32)0x00000000U)
#define LPI2C_SCR_FILTER_DISABLED_IN_DOZE_U32  (LPI2C_SCR_FILTDZ_MASK_U32)

#define LPI2C_SCR_FILTER_ENABLED_U32           (LPI2C_SCR_FILTEN_MASK_U32)
#define LPI2C_SCR_FILTER_DISABLED_U32          ((uint32)0x00000000U)
   
#define LPI2C_SCR_SLAVE_ENABLE_U32             (LPI2C_SCR_SEN_MASK_U32)
#define LPI2C_SCR_SLAVE_DISABLE_U32            ((uint32)0x00000000U)

/**
* @brief    LPI2C Registers bits.
* @details  SSR register bit masks.
*/
#define LPI2C_SSR_RWBITS_MASK_U32               ((uint32)0x00000F00U)
        
#define LPI2C_SSR_BBF_MASK_U32                  ((uint32)0x02000000U)
#define LPI2C_SSR_SBF_MASK_U32                  ((uint32)0x01000000U)
#define LPI2C_SSR_SARF_MASK_U32                 ((uint32)0x00008000U)
#define LPI2C_SSR_GCF_MASK_U32                  ((uint32)0x00004000U)
#define LPI2C_SSR_AM1F_MASK_U32                 ((uint32)0x00002000U)
#define LPI2C_SSR_AM0F_MASK_U32                 ((uint32)0x00001000U)
#define LPI2C_SSR_FEF_MASK_U32                  ((uint32)0x00000800U)
#define LPI2C_SSR_BEF_MASK_U32                  ((uint32)0x00000400U)
#define LPI2C_SSR_SDF_MASK_U32                  ((uint32)0x00000200U)
#define LPI2C_SSR_RSF_MASK_U32                  ((uint32)0x00000100U)
#define LPI2C_SSR_TAF_MASK_U32                  ((uint32)0x00000008U)
#define LPI2C_SSR_AVF_MASK_U32                  ((uint32)0x00000004U)
#define LPI2C_SSR_RDF_MASK_U32                  ((uint32)0x00000002U)
#define LPI2C_SSR_TDF_MASK_U32                  ((uint32)0x00000001U)

#define LPI2C_SSR_ERROR_FLAGS_MASK_U32          ((uint32)0x00000C00U)

#define LPI2C_SLAVE_BUS_IS_BUSY_U32             (LPI2C_SSR_BBF_MASK_U32)
#define LPI2C_SLAVE_BUS_IS_IDLE_U32             ((uint32)0x00000000U)

#define LPI2C_SLAVE_IS_BUSY_U32                 (LPI2C_SSR_SBF_MASK_U32)
#define LPI2C_SLAVE_IS_IDLE_U32                 ((uint32)0x00000000U)

#define LPI2C_SMBUS_ALERT_RESPONSE_DETECTED_U32 (LPI2C_SSR_SARF_MASK_U32)

#define LPI2C_GENERAL_CALL_ADDRESS_DETECTED_U32 (LPI2C_SSR_GCF_MASK_U32)

#define LPI2C_ADDRESS1_MATCH_U32                (LPI2C_SSR_AM1F_MASK_U32)
        
#define LPI2C_ADDRESS0_MATCH_U32                (LPI2C_SSR_AM0F_MASK_U32)

#define LPI2C_SLAVE_FIFO_ERROR_DETECTED_U32     (LPI2C_SSR_FEF_MASK_U32)

#define LPI2C_SLAVE_BIT_ERROR_DETECTED_U32      (LPI2C_SSR_BEF_MASK_U32)

#define LPI2C_SLAVE_STOP_DETECTED_U32           (LPI2C_SSR_SDF_MASK_U32)

#define LPI2C_SLAVE_REPEATED_START_DETECTED_U32 (LPI2C_SSR_RSF_MASK_U32)
        
#define LPI2C_TRANSMIT_ACK_NOT_REQUIRED_U32     ((uint32)0x00000000U)
#define LPI2C_TRANSMIT_ACK_REQUIRED_U32         (LPI2C_SSR_TAF_MASK_U32)

#define LPI2C_SLAVE_ADDRESS_VALID_U32           (LPI2C_SSR_AVF_MASK_U32)

#define LPI2C_SLAVE_RECEIVE_DATA_IS_READY_U32   (LPI2C_SSR_RDF_MASK_U32)
        
#define LPI2C_SLAVE_TRANSMIT_DATA_IS_READY_U32  (LPI2C_SSR_TDF_MASK_U32)
        
/**
* @brief    LPI2C Registers bits.
* @details  SIER register bit masks.
*/
#define LPI2C_SIER_RWBITS_MASK_U32                  ((uint32)0x0000FF0FU)
                                                    
#define LPI2C_SIER_SARIE_MASK_U32                   ((uint32)0x00008000U)
#define LPI2C_SIER_GCIE_MASK_U32                    ((uint32)0x00004000U)
#define LPI2C_SIER_AM1IE_MASK_U32                   ((uint32)0x00002000U)
#define LPI2C_SIER_AM0IE_MASK_U32                   ((uint32)0x00001000U)
#define LPI2C_SIER_FEIE_MASK_U32                    ((uint32)0x00000800U)
#define LPI2C_SIER_BEIE_MASK_U32                    ((uint32)0x00000400U)
#define LPI2C_SIER_SDIE_MASK_U32                    ((uint32)0x00000200U)
#define LPI2C_SIER_RSIE_MASK_U32                    ((uint32)0x00000100U)
#define LPI2C_SIER_TAIE_MASK_U32                    ((uint32)0x00000008U)
#define LPI2C_SIER_AVIE_MASK_U32                    ((uint32)0x00000004U)
#define LPI2C_SIER_RDIE_MASK_U32                    ((uint32)0x00000002U)
#define LPI2C_SIER_TDIE_MASK_U32                    ((uint32)0x00000001U)
                                                    
#define LPI2C_SMBUS_ALERT_ISR_ENABLE_U32            (LPI2C_SIER_SARIE_MASK_U32)
#define LPI2C_SMBUS_ALERT_ISR_DISABLE_U32           ((uint32)0x00000000U)
                                                    
#define LPI2C_GENERAL_CALL_ISR_ENABLE_U32           (LPI2C_SIER_GCIE_MASK_U32)
#define LPI2C_GENERAL_CALL_ISR_DISABLE_U32          ((uint32)0x00000000U)
                                                    
#define LPI2C_ADDRESS1_MATCH_ISR_ENABLE_U32         (LPI2C_SIER_AM1IE_MASK_U32)
#define LPI2C_ADDRESS1_MATCH_ISR_DISABLE_U32        ((uint32)0x00000000U)
                                                    
#define LPI2C_ADDRESS0_MATCH_ISR_ENABLE_U32         ((uint32)0x00000000U)
#define LPI2C_ADDRESS0_MATCH_ISR_DISABLE_U32        (LPI2C_SIER_AM0IE_MASK_U32)
                                                    
