marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_LPI2C.h
#define LPI2C_SLAVE_FIFO_ERROR_ISR_ENABLE_U32       (LPI2C_SIER_FEIE_MASK_U32)
#define LPI2C_SLAVE_FIFO_ERROR_ISR_DISABLE_U32      ((uint32)0x00000000U)
                                                    
#define LPI2C_SLAVE_BIT_ERROR_ISR_ENABLE_U32        (LPI2C_SIER_BEIE_MASK_U32)
#define LPI2C_SLAVE_BIT_ERROR_ISR_DISABLE_U32       ((uint32)0x00000000U)
    
#define LPI2C_SLAVE_STOP_DETECT_ISR_ENABLE_U32      (LPI2C_SIER_SDIE_MASK_U32)
#define LPI2C_SLAVE_STOP_DETECT_ISR_DISABLE_U32     ((uint32)0x00000000U)
    
#define LPI2C_REPEATED_START_ISR_ENABLE_U32         (LPI2C_SIER_RSIE_MASK_U32)
#define LPI2C_REPEATED_START_ISR_DISABLE_U32        ((uint32)0x00000000U)
    
#define LPI2C_TRANSMIT_ACK_ISR_ENABLE_U32           (LPI2C_SIER_TAIE_MASK_U32)
#define LPI2C_TRANSMIT_ACK_ISR_DISABLE_U32          ((uint32)0x00000000U)
    
#define LPI2C_ADDRESS_VALID_ISR_ENABLE_U32          (LPI2C_SIER_AVIE_MASK_U32)
#define LPI2C_ADDRESS_VALID_ISR_DISABLE_U32         ((uint32)0x00000000U)

#define LPI2C_SLAVE_RECEIVE_DATA_ISR_ENABLE_U32     (LPI2C_SIER_RDIE_MASK_U32)
#define LPI2C_SLAVE_RECEIVE_DATA_ISR_DISABLE_U32    ((uint32)0x00000000U)
                                                    
#define LPI2C_SLAVE_TRANSMIT_DATA_ISR_ENABLE_U32    (LPI2C_SIER_TDIE_MASK_U32)
#define LPI2C_SLAVE_TRANSMIT_DATA_ISR_DISABLE_U32   ((uint32)0x00000000U)

/**
* @brief    LPI2C Registers bits.
* @details  SDER register bit masks.
*/
#define LPI2C_SDER_AVDE_MASK_U32                ((uint32)0x00000004U)
#define LPI2C_SDER_RDDE_MASK_U32                ((uint32)0x00000002U)
#define LPI2C_SDER_TDDE_MASK_U32                ((uint32)0x00000001U)

/**
* @brief    LPI2C Registers bits.
* @details  SCFGR1 register bit masks.
*/
#define LPI2C_SCFGR1_ADDRCFG_MASK_U32         ((uint32)0x00070000U)
#define LPI2C_SCFGR1_HSMEN_MASK_U32           ((uint32)0x00002000U)
#define LPI2C_SCFGR1_IGNACK_MASK_U32          ((uint32)0x00001000U)
#define LPI2C_SCFGR1_RXCFG_MASK_U32           ((uint32)0x00000800U)
#define LPI2C_SCFGR1_TXCFG_MASK_U32           ((uint32)0x00000400U)
#define LPI2C_SCFGR1_SAEN_MASK_U32            ((uint32)0x00000200U)
#define LPI2C_SCFGR1_GCEN_MASK_U32            ((uint32)0x00000100U)
#define LPI2C_SCFGR1_ACKSTALL_MASK_U32        ((uint32)0x00000008U)
#define LPI2C_SCFGR1_TXDSTALL_MASK_U32        ((uint32)0x00000004U)
#define LPI2C_SCFGR1_RXDSTALL_MASK_U32        ((uint32)0x00000002U)
#define LPI2C_SCFGR1_ADRSTALL_MASK_U32        ((uint32)0x00000001U)

#define LPI2C_SLAVE_MATCH_ADDR0_7BIT_U32      ((uint32)0x00000000U)
#define LPI2C_SLAVE_MATCH_ADDR0_10BIT_U32     ((uint32)0x00010000U)

#define LPI2C_ENABLE_DETECTION_OF_HS_U32      (LPI2C_SCFGR1_HSMEN_MASK_U32)
#define LPI2C_DISABLE_DETECTION_OF_HS_U32     ((uint32)0x00000000U)

#define LPI2C_ACK_SCL_STALL_ENABLE_U32        (LPI2C_SCFGR1_ACKSTALL_MASK_U32)
#define LPI2C_ACK_SCL_STALL_DISABLE_U32       ((uint32)0x00000000U)
                                              
#define LPI2C_TX_DATA_SCL_STALL_ENABLE_U32    (LPI2C_SCFGR1_TXDSTALL_MASK_U32)
#define LPI2C_TX_DATA_SCL_STALL_DISABLE_U32   ((uint32)0x00000000U)
                                              
#define LPI2C_RX_DATA_SCL_STALL_ENABLE_U32    (LPI2C_SCFGR1_RXDSTALL_MASK_U32)
#define LPI2C_RX_DATA_SCL_STALL_DISABLE_U32   ((uint32)0x00000000U)
                                              
#define LPI2C_ADDRESS_SCL_STALL_ENABLE_U32    (LPI2C_SCFGR1_ADRSTALL_MASK_U32)
#define LPI2C_ADDRESS_SCL_STALL_DISABLE_U32   ((uint32)0x00000000U)

/**
* @brief    LPI2C Registers bits.
* @details  SCFGR2 register bit masks.
*/
#define LPI2C_SCFGR2_FILTSDA_MASK_U32   ((uint32)0x0F000000U)
#define LPI2C_SCFGR2_FILTSDA_SHIFT_U32  ((uint32)24U)
#define LPI2C_SCFGR2_FILTSCL_MASK_U32   ((uint32)0x000F0000U)
#define LPI2C_SCFGR2_FILTSCL_SHIFT_U32  ((uint32)16U)
#define LPI2C_SCFGR2_DATAVD_MASK_U32    ((uint32)0x00003F00U)
#define LPI2C_SCFGR2_DATAVD_SHIFT_U32   ((uint32)8U)
#define LPI2C_SCFGR2_CLKHOLD_MASK_U32   ((uint32)0x0000000FU)

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_SLAVE_FILTSDA_U32(value)  ((uint32)((uint32)((value) << LPI2C_SCFGR2_FILTSDA_SHIFT_U32) & LPI2C_SCFGR2_FILTSDA_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_SLAVE_FILTSCL_U32(value)  ((uint32)((uint32)((value) << LPI2C_SCFGR2_FILTSCL_SHIFT_U32) & LPI2C_SCFGR2_FILTSCL_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_SLAVE_DATAVD_U32(value)   ((uint32)((uint32)((value) << LPI2C_SCFGR2_DATAVD_SHIFT_U32) & LPI2C_SCFGR2_DATAVD_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_SLAVE_CLKHOLD_U32(value)  (((value) & LPI2C_SCFGR2_CLKHOLD_MASK_U32))

/**
* @brief    LPI2C Registers bits.
* @details  SAMR register bit masks.
*/
#define LPI2C_SAMR_ADDR1_MASK_U32       ((uint32)0x007FE000U)
#define LPI2C_SAMR_ADDR1_SHIFT_U32      ((uint32)17U)
#define LPI2C_SAMR_ADDR0_MASK_U32       ((uint32)0x000007FEU)
#define LPI2C_SAMR_ADDR0_SHIFT_U32      ((uint32)1U)

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_ADDR1_U32(value)          ((uint32)((uint32)((value) << LPI2C_SAMR_ADDR1_SHIFT_U32) & LPI2C_SAMR_ADDR1_MASK_U32))

/** @violates @ref Reg_eSys_LPI2C_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define LPI2C_ADDR0_U32(value)          ((uint32)((uint32)((value) << LPI2C_SAMR_ADDR0_SHIFT_U32) & LPI2C_SAMR_ADDR0_MASK_U32))

/**
* @brief    LPI2C Registers bits.
* @details  SASR register bit masks.
*/
#define LPI2C_SASR_ANV_MASK_U32         ((uint32)0x00004000U)
#define LPI2C_SASR_RADDR_MASK_U32       ((uint32)0x000007FFU)
                                        
#define LPI2C_RADDR_IS_NOT_VALID_U32    (LPI2C_SASR_ANV_MASK_U32)
#define LPI2C_RADDR_IS_VALID_U32        ((uint32)0x00000000U)

/**
* @brief    LPI2C Registers bits.
* @details  STAR register bit masks.
*/
#define LPI2C_STAR_TXNACK_MASK_U32      ((uint32)0x00000001U)

#define LPI2C_TRANSMIT_ACK_U32          ((uint32)0x00000000U)
#define LPI2C_TRANSMIT_NACK_U32         (LPI2C_STAR_TXNACK_MASK_U32)

/**
* @brief    LPI2C Registers bits.
* @details  STDR register bit masks.
*/
#define LPI2C_STDR_DATA_MASK_U32        ((uint32)0x000000FFU)

/**
* @brief    LPI2C Registers bits.
* @details  SRDR register bit masks.
*/
#define LPI2C_SRDR_SOF_MASK_U32                   ((uint32)0x00008000U)
#define LPI2C_SRDR_RXEMPTY_MASK_U32               ((uint32)0x00004000U)
#define LPI2C_SRDR_DATA_MASK_U32                  ((uint32)0x000000FFU)
  
#define LPI2C_START_OF_FRAME_DETECTED_U32         (LPI2C_SRDR_SOF_MASK_U32)
#define LPI2C_RDR_NOT_EMPTY_U32                   ((uint32)0x00000000U)
#define LPI2C_RDR_EMPTY_U32                       (LPI2C_SRDR_RXEMPTY_MASK_U32)

#define LPI2C_FIFO_SIZE_U8                        (0x04U)
/*==================================================================================================
                                             ENUMS
==================================================================================================*/

/*==================================================================================================
                                 STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/

/*==================================================================================================
                                 GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/

#ifdef __cplusplus
}
#endif

#endif /* REG_eSys_LPI2C_H */

/** @} */
